chore: add readme & docs
